{
  "locations": {
    "icy cave": {
      "element1": "ice",
      "element2": "rock",
      "death_message": "The ledge here is covered in ice, but I think I can make it\n USER HAS DISCONNECTED",
      "success_message": "I found something in the wall of the cave",
      "messages": [
          "Cavediving is hard enough when it's warm",
          "Almost slipped but I caught myself",
          "I'll be honest, the light makes some of this ice really pretty",
          "Some of this rock is really soft, gonna have to anchor into the ice",
          "How deep does this cave go?"
      ]
    },
    "frozen lake": {
      "element1": "ice",
      "element2": "water",
      "death_message": "Ok, that was definitely creaking, maybe cracking, I'll just... back up... slowly...\n USER HAS DISCONNECTED",
      "success_message": "I found something trapped under the ice",
      "messages": [
          "Did the ice just creak?",
          "I hear something skittering on the ice... I hope its just the wind or something",
          "Black ice is safe right? Its the grey stuff you can't walk on",
          "I think I see a box or something under the ice",
          "This is why I don't like ice skating"
      ]
    },
    "office building": {
      "element1": "urban",
      "element2": "office",
      "death_message": "Hold on, the fire alarm is going off. I should be able to get out the emergency exit\n USER HAS DISCONNECTED",
      "success_message": "I managed to download a file from the computer",
      "messages": [
          "Hope security doesn't find me",
          "Somebody must have burnt some popcorn, ugh, hate when that happens",
          "I know its not what I'm looking for, but I found someone's candy drawer... Jackpot",
          "The printer went off, scared the hell out of me",
          "I think someone is in their office working late, but I don't think they saw me"
      ]
    },
    "forest lake": {
      "element1": "forest",
      "element2": "water",
      "death_message": "Something is moving in the lake. I should be safe on the shore, but its getting closer\n USER HAS DISCONNECTED",
      "success_message": "I found something buried near a tree",
      "messages": [
          "This is probably nice when its not spooky",
          "Somebody seems to have been digging near some of these trees",
          "There's a little bit of a path going around the lake",
          "Huh, there are some footprints in the mud here",
          "I wonder how many people come out here?"
      ]
    },
    "construction site": {
      "element1": "office",
      "element2": "rock",
      "death_message": "I could swear I heard the crane startup, but I don't see anybody in the cab. I'm going to check it out\n USER HAS DISCONNECTED",
      "success_message": "Found something, it was tucked in someone's toolbox",
      "messages": [
          "Should've brought a hard hat with me",
          "OSHA would have a field day here.",
          "I think someone forgot their lunch box",
          "Mom always warned me not to play in work sites... hope she was wrong",
          "What are they even building here?"

      ]
    },
    "snowy alley": {
      "element1": "ice",
      "element2": "urban",
      "death_message": "I think someone just came in the alley, I'm hiding behind the dumpster\n USER HAS DISCONNECTED",
      "success_message": "I found something buried in the snow",
      "messages": [
          "It's eerily quiet when it snows like this...", 
          "I think I see something shining in the snow",
          "Eww, I think I stepped in something... unpleasant",
          "This place reaks. I hope its the dumpster...",
          "Ok, that rat was huge. I'm a little grossed out, but kind of impressed too"
      ]
    },
    "cemetary": {
      "element1": "urban",
      "element2": "rock",
      "death_message": "Hold on, I think I see someone... I'm going to ask them for help.\n USER HAS DISCONNECTED",
      "success_message": "I found something scrawled on the back of a gravestone",
      "messages": [
          "If I see a ghost, I am running",
          "You know, in a zombie virus outbreak, a cemetary is actually probably pretty safe",
          "Its always sad to see the markers with the dates close together",
          "How old is this cemetary?",
          "Someone make sure they put Brave Investigator on my tombstone when I die"
      ]
    },
    "park": {
      "element1": "urban",
      "element2": "forest",
      "death_message": "I think someone is following me, I'm going to make a break for it, and see if I can get back to the street\n USER HAS DISCONNECTED",
      "success_message": "I found something in one of the bushes.",
      "messages": [
          "I think I heard there were drug dealers in this park at night",
          "Why do they tell you to stay off the grass in the park. Isn't that kind of the point?",
          "Huh, they have a little dog park area, that's kind of nice",
          "Nothing in the pavilions, thought I saw something under the tables",
          "There's more litter than I would have thought"
      ]
    },
    "forest cabin": {
      "element1": "forest",
      "element2": "office",
      "death_message": "I found a recorder, some sort of notes from the researcher. I'm going to play it, I'll let you know what it says\n USER HAS DISCONNECTED",
      "success_message": "I found something shoved in a book",
      "messages": [
          "Getting some real Evil Dead vibes here",
          "Why do the crazy researchers always choose the creepiest cabins",
          "OMG IM GONNA DIE...Never mind... It was a raccoon...",
          "I found some old magazines, um... nevemind"
      ]
    },
    "hot spring": {
      "element1": "water",
      "element2": "rock",
      "death_message": "I might need to check the other bath, but I thought I heard someone in there\n USER HAS DISCONNECTED",
      "success_message": "I found something in one of the lockers",
      "messages": [
          "I didn't know we had one of these in the area",
          "I've got to come back when they are open. I could use some relaxation after this case.",
          "There are a lot of lockers in here",
          "Found where they keep the extra towels",
          "I don't know why I thought to check the shower drains, but I regret it"
      ]
    }
  },
  "investigators": {
    "Josh": {
        "color": [255, 140, 0],
        "specialty": "office"
    },
    "Charlie": {
        "color": [0, 255, 255],
        "specialty": "ice"
    },
    "Hassan": {
        "color": [0, 255, 0],
        "specialty": "forest"
    },
    "Chris": {
        "color": [0, 0, 255],
        "specialty": "water"
    },
    "Patrick": {
        "color": [0, 0, 0],
        "specialty": "rock"
    },
    "Brian": {
        "color": [102, 51, 153],
        "specialty": "urban"
    }
  },
  "clues": ["clue1.png", "clue2.png", "clue3.png", "clue4.ogg", "clue5.png", "clue6.png"],
  "starting_messages": [
    "Hey, guys. I need some help.",
    "Remember that tomb I wanted to explore?",
    "I know you told me not to, but I couldn't help myself",
    "I went anyway and I got trapped. There's something behind me",
    "I managed to grab a photo of it, I think it might be the Eye that Follows from the book",
    "Its coming for me but its very slow, I think it will take about 14 hours",
    "I'm stuck in this room, there's a door with runes on it, I'll send you a photo",
    "Chadwick Pendleton built this room, maybe you guys could find some clues?",
    "We're on it, I know just where to send the team. Stay safe."
  ],
  "ending_message": "Ok, I'm through, I'll let you know what I find in the next chamber.",
  "victim_death": "I can hear it getting close, I'm going to try the door. I'll let you know what I find if I reach the next chamber. USER HAS DISCONNECTED"
}
